const clients1 = ["Гилберт", "Сальваторе", "Пирс", "Соммерс", "Форбс", "Донован", "Беннет"];
const clients2 = ["Пирс", "Зальцман", "Сальваторе", "Майклсон"];

const [...clients] = new Set([...clients1 ,...clients2]);

console.log(clients);



//    Обьясните своими словами, как вы понимаете, что такое деструктуризация и зачем она нужна.

//Деструктуризація - синтаксична можливість "розкласти" елементи масивів і об’єктів на окремі змінні.
//Деструктуризація дозволяє витягти з масиву її частини, коли нас цікавить тільки частина масиву, причому як початок, так і його кінець.